#+Title:     IX Ciencia de datos avanzada: Spark
#+Author:    Adolfo De Unánue
#+Email:     adolfo.deunanue@itam.mx
#+DATE:      2017
#+DESCRIPTION: 
#+KEYWORDS:  
#+LANGUAGE:  en

#+STARTUP: beamer
#+STARUP: oddeven

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation, smaller]

#+BEAMER_THEME: DarkConsole

#+OPTIONS: H:1 toc:nil 
#+OPTIONS: tex:t

#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

#+COLUMNS: %20ITEM %13BEAMER_env(Env) %6BEAMER_envargs(Args) %4BEAMER_col(Col) %7BEAMER_extra(Extra)

* Checklist: Docker

- Si no lo instalaron:
  - https://store.docker.com/editions/community/docker-ce-server-ubuntu?tab=description 

- Si ya lo instalaron, verifiquen:

#+begin_src shell :results verbatim drawer
docker --version
#+end_src

#+RESULTS:
:RESULTS:
Docker version 17.04.0-ce, build 4845c56
:END:

* Docker compose

- Damos permisos de ejecución

#+begin_example
## Aún dentro del usuario root
## (o agrega sudo al principio)
chmod +x /usr/local/bin/docker-compose
#+end_example


#+begin_src shell  :results verbatim drawer
docker-compose --version
#+end_src
#+RESULTS:
:RESULTS:
docker-compose version 1.10.0, build 4bd6f1a
:END:

